#ifndef COLORS_H
#define COLORS_H

#define res "\033[0m"
#define red "\033[31m"
#define gr "\033[32m"
#define yell "\033[33m"
#define blue "\033[34m"
#define cy "\033[36m"

#define v cy "│" res
#define header cy "┌────┬───────────────┬───────────────┬───────────┬──────┬────────┬───────┬──────────────┬─────────────────────────┬───────┬───────┐\n""│" res " Id "v "    Фамилия    " v "      Имя      " v "    Пол    " v "Группа" v " Возраст" v "  С/О  " v " Дата поступ. " v "        Ул/№Общаги       " v " №Д/№К " v "  №Кв  " v
#define between cy "├────┼───────────────┼───────────────┼───────────┼──────┼────────┼───────┼──────────────┼─────────────────────────┼───────┼───────┤" res
#define end cy "└────┴───────────────┴───────────────┴───────────┴──────┴────────┴───────┴──────────────┴─────────────────────────┴───────┴───────┘\n" res

#endif
